structure Tests =
struct
  val testsAdd : (IntInf.int * IntInf.int) list = [
    (4000,3334),
    (3,2),
    (123, 937),
    (1024,1024),
    (0,0),
    (1023,1),
    (1551, 123),
    (1754, 1578),
    (12,456123789),                 (*自己添加的样例*)
    (45678912,35)                   (*自己添加的样例*)
  ]

  val testsSub : (IntInf.int * IntInf.int) list = [
    (4000,3334),
    (3,2),
    (1024, 937),
    (1024,1),
    (884,121),
    (65536,1024),
    (65535,1023),
    (15945786123,12)            (*自己添加的样例*)
  ]

  val testsMul : (IntInf.int * IntInf.int) list = [
    (4000,3334),
    (3,2),
    (123, 937),
    (0,0),
    (0,1),
    (1,0),               (*自己添加的样例*)
    (100,50),            (*自己添加的样例*)
    (15,731649),         (*自己添加的样例*)
    (78758399045,89834590)
  ]

end
